Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_regdef.h
/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SPBWD_BND_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_SPBWD_BND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SPBWD_MSK_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_SPBWD_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SPBWD_RNG_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_SPBWD_RNG;

/** \brief Comparator Sign Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SPBWD_SGN_Bits B;        /**< \brief Bitfield access */
} Ifx_MCDS_SPBWD_SGN;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1AC_BND_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1AC_BND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1AC_MSK_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1AC_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1AC_RNG_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1AC_RNG;

/** \brief Lookup Table Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1BALLUTA_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1BALLUTA;

/** \brief Lookup Table Data Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1BALLUTD_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1BALLUTD;

/** \brief Lookup Table Base Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1BAL_BND_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1BAL_BND;

/** \brief Lookup Table Mapping Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1BAL_MAP_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1BAL_MAP;

/** \brief Lookup Table Range Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1BAL_RNG_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1BAL_RNG;

/** \brief DTU FIFOs Fill Level   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1DTUFLV_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1DTUFLV;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1EA_BND_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1EA_BND;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1EA_RNG_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1EA_RNG;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_BND_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_BND;

/** \brief Comparator Bound Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_HBND_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_HBND;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_HMSK_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_HMSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_HRNG_Bits B;      /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_HRNG;

/** \brief Comparator Mask Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_MSK_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_MSK;

/** \brief Comparator Range Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_RNG_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_RNG;

/** \brief Comparator Sign Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_MCDS_SRI1WD_SGN_Bits B;       /**< \brief Bitfield access */
} Ifx_MCDS_SRI1WD_SGN;

