Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_regdef.h
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SPBAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SPBAC object */
typedef volatile struct _Ifx_MCDS_SPBAC
{
       Ifx_MCDS_SPBAC_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SPBAC_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_SPBAC_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_SPBAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI1BAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI1BAL object */
typedef volatile struct _Ifx_MCDS_SRI1BAL
{
       Ifx_MCDS_SRI1BAL_BND                BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDS_SRI1BAL_RNG                RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDS_SRI1BAL_MAP                MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_SRI1BAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI2BAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI2BAL object */
typedef volatile struct _Ifx_MCDS_SRI2BAL
{
       Ifx_MCDS_SRI2BAL_BND                BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDS_SRI2BAL_RNG                RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDS_SRI2BAL_MAP                MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_SRI2BAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI1EA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI1EA object */
typedef volatile struct _Ifx_MCDS_SRI1EA
{
       Ifx_MCDS_SRI1EA_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI1EA_RNG                 RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_SRI1EA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI1WD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI1WD object */
typedef volatile struct _Ifx_MCDS_SRI1WD
{
       Ifx_MCDS_SRI1WD_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI1WD_HBND                HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI1WD_RNG                 RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI1WD_HRNG                HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI1WD_MSK                 MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDS_SRI1WD_HMSK                HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDS_SRI1WD_SGN                 SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDS_SRI1WD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI1AC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI1AC object */
typedef volatile struct _Ifx_MCDS_SRI1AC
{
       Ifx_MCDS_SRI1AC_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI1AC_RNG                 RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI1AC_MSK                 MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_SRI1AC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI2EA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI2EA object */
typedef volatile struct _Ifx_MCDS_SRI2EA
{
       Ifx_MCDS_SRI2EA_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI2EA_RNG                 RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_SRI2EA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI2WD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI2WD object */
typedef volatile struct _Ifx_MCDS_SRI2WD
{
       Ifx_MCDS_SRI2WD_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI2WD_HBND                HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI2WD_RNG                 RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI2WD_HRNG                HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI2WD_MSK                 MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDS_SRI2WD_HMSK                HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDS_SRI2WD_SGN                 SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDS_SRI2WD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_SRI2AC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief SRI2AC object */
typedef volatile struct _Ifx_MCDS_SRI2AC
{
       Ifx_MCDS_SRI2AC_BND                 BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_SRI2AC_RNG                 RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_SRI2AC_MSK                 MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_SRI2AC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZPAL_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZPAL object */
typedef volatile struct _Ifx_MCDS_TCZPAL
{
       Ifx_MCDS_TCZPAL_BND                 BND;                    /**< \brief 0, Lookup Table Base Register*/
       Ifx_MCDS_TCZPAL_RNG                 RNG;                    /**< \brief 4, Lookup Table Range Register*/
       Ifx_MCDS_TCZPAL_MAP                 MAP;                    /**< \brief 8, Lookup Table Mapping Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCZPAL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZEA_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZEA object */
typedef volatile struct _Ifx_MCDS_TCZEA
{
       Ifx_MCDS_TCZEA_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZEA_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCZEA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZWD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZWD object */
typedef volatile struct _Ifx_MCDS_TCZWD
{
       Ifx_MCDS_TCZWD_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZWD_HBND                 HBND;                   /**< \brief 4, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZWD_RNG                  RNG;                    /**< \brief 8, Comparator Range Register ${x}*/
       Ifx_MCDS_TCZWD_HRNG                 HRNG;                   /**< \brief C, Comparator Range Register ${x}*/
       Ifx_MCDS_TCZWD_MSK                  MSK;                    /**< \brief 10, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCZWD_HMSK                 HMSK;                   /**< \brief 14, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_18[4];         /**< \brief 18, \internal Reserved */
       Ifx_MCDS_TCZWD_SGN                  SGN;                    /**< \brief 1C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCZWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZAC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZAC object */
typedef volatile struct _Ifx_MCDS_TCZAC
{
       Ifx_MCDS_TCZAC_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZAC_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCZAC_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
} Ifx_MCDS_TCZAC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZID_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZID object */
typedef volatile struct _Ifx_MCDS_TCZID
{
       Ifx_MCDS_TCZID_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZID_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_MCDS_TCZID_MSK                  MSK;                    /**< \brief 8, Comparator Mask Register ${x}*/
       Ifx_MCDS_TCZID_SGN                  SGN;                    /**< \brief C, Comparator Sign Register ${x}*/
} Ifx_MCDS_TCZID;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_TCZIP_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief TCZIP object */
typedef volatile struct _Ifx_MCDS_TCZIP
{
       Ifx_MCDS_TCZIP_BND                  BND;                    /**< \brief 0, Comparator Bound Register ${x}*/
       Ifx_MCDS_TCZIP_RNG                  RNG;                    /**< \brief 4, Comparator Range Register ${x}*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_MCDS_TCZIP;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Mcds_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

